#
# 1. Ввод и вывод:
#    - `print()`: выводит текст или значения переменных на консоль.
#    - `input()`: получает ввод от пользователя.
# 2. Математические функции:
#    - `abs()`: возвращает абсолютное значение числа.
#    - `min()`: возвращает наименьшее значение из переданных аргументов.
#    - `max()`: возвращает наибольшее значение из переданных аргументов.
#    - `sum()`: возвращает сумму всех элементов в контейнере.
#    - `round()`: округляет число до указанного количества знаков после запятой.
# 3. Работа со строками:
#    - `len()`: возвращает длину строки или количество элементов в контейнере.
#    - `str()`: преобразует объект в строку.
#    - `lower()`: переводит все символы строки в нижний регистр.
#    - `upper()`: переводит все символы строки в верхний регистр.
#    - `split()`: разделяет строку на подстроки по указанному разделителю.
#    - `join()`: объединяет строки из контейнера в одну строку, вставляя между ними указанный разделитель.
# 4. Работа с списками:
#    - `list()`: создает новый список.
#    - `append()`: добавляет элемент в конец списка.
#    - `extend()`: добавляет элементы из другого списка в конец текущего списка.
#    - `insert()`: вставляет элемент в указанную позицию списка.
#    - `remove()`: удаляет первое вхождение указанного элемента из списка.
#    - `pop()`: удаляет и возвращает элемент из указанной позиции списка.
# 5. Условные операторы:
#    - `if`, `else`, `elif`: используются для выполнения различного кода в зависимости от условий.
# 6. Циклы:
#    - `for`: выполняет цикл для каждого элемента в последовательности.
#    - `while`: выполняет цикл до тех пор, пока выполняется определенное условие.
# 7. Операторы для работы с файлами:
#    - `open()`: открывает файл для чтения или записи.
#    - `read()`: считывает содержимое файла.
#    - `write()`: записывает данные в фай